{
  "architectures": [
    "MiniMindForCausalLM"
  ],
  "model_type": "minimind",
  "hidden_size": 2048,
  "num_hidden_layers": 22,
  "num_attention_heads": 16,
  "num_key_value_heads": 4,
  "head_dim": 128,
  "hidden_act": "silu",
  "intermediate_size": 5632,
  "max_position_embeddings": 32768,
  "rms_norm_eps": 1e-06,
  "rope_theta": 1000000.0,
  "vocab_size": 32000,
  "bos_token_id": 1,
  "eos_token_id": 2,
  "tie_word_embeddings": true,
  "flash_attn": true,
  "dropout": 0.0,
  "inference_rope_scaling": false,
  "use_moe": true,
  "num_experts": 8,
  "num_experts_per_tok": 2,
  "moe_intermediate_size": 5632,
  "norm_topk_prob": true,
  "router_aux_loss_coef": 5e-4,
  "layer_share_factor": 1,
  "mtp_num_heads": 2,
  "mtp_loss_weight": 0.1,
  "ttt_enabled": false,
  "ttt_lr": 1e-4,
  "ttt_chunk_size": 512,
  "ttt_layers": null
}
